emacs.org
#+title: Emacs

* Early Init
:PROPERTIES:
:header-args: :tangle ~/.config/emacs/early-init.el
:END:
#+begin_src emacs-lisp
  ;;; early-init.el -*- lexical-binding: t; -*-
  (setq load-prefer-newer t)
  (setq package-quickstart t)
  (setq frame-inhibit-implied-resize t)
#+end_src

#+begin_src emacs-lisp
  (when (boundp 'comp-eln-load-path)
    (setcar (nthcdr 0 comp-eln-load-path)
     (expand-file-name "var/eln-cache/" user-emacs-directory)))
#+end_src

#+begin_src emacs-lisp
  (defvar actuator-gc-cons-threshold gc-cons-threshold
    "Original value for `gc-cons-threshold'.")
  (defun actuator-restore-gc-cons-threshold ()
    "Restore `gc-cons-threshold' value."
    (setq gc-cons-threshold actuator-gc-cons-threshold)
    (garbage-collect))
  (add-hook 'after-init-hook #'actuator-restore-gc-cons-threshold)
  (setq gc-cons-threshold (* 5 1024 1024 1024))
#+end_src

#+begin_src emacs-lisp
  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src

* Init
:PROPERTIES:
:header-args: :tangle ~/.config/emacs/init.el :comments link :noweb yes :mkdirp yes
:END:
** Lexical Binding
#+begin_src emacs-lisp
  ;;; init.el -*- lexical-binding: t; -*-
#+end_src

** Package Init

#+begin_src emacs-lisp
  (require 'package)
  (package-initialize)

  (setq package-archives
        '(("org"    . "https://orgmode.org/elpa/")
          ("melpa"  . "https://melpa.org/packages/")
          ("gnu"    . "https://elpa.gnu.org/packages/")
          ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

  (setq package-archive-priorities '(("org"   . 40)
                                     ("melpa" . 30)
                                     ("gnu"   . 20)
                                     ("nongnu". 10)))

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-when-compile
    (require 'use-package nil t))
  (require 'use-package-ensure nil t)
  (setq use-package-always-ensure t)
#+end_src

** No Littering
#+begin_src emacs-lisp
  (use-package no-littering
    :ensure t)
#+end_src

** Exec path from shell
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :ensure
    :demand t
    :custom
    (exec-path-from-shell-arguments '("-l" "-i"))
    :config
    (when (eq system-type 'darwin)
      (exec-path-from-shell-initialize)))
#+end_src

* Theme
#+begin_src emacs-lisp :tangle ~/.config/emacs/actuator-theme.el
  (deftheme actuator)

  (add-hook 'minibuffer-setup-hook 'actuator--minibuffer-setup)

  (defun actuator--minibuffer-setup ()
         (set (make-local-variable 'face-remapping-alist)
            '((org-document-title :height 1.0))))

  (let ((blue  "#29BEEA")
        (white "#FFFFFF")
        (dark  "#000000")
        (cyan  "#00FFFF")
        (red   "#8b0000")
        (grey  "#484e55")
        (lgrey "#bdc4cc")

        (highlight-dim "#B1F8FF")
        (code-background "#FFFFFF")

        (xgrey "#F5F6F8")
        (xbord "#EDF0F4"))

    (custom-theme-set-faces
     `actuator
     `(fixed-pitch ((t (:family "SF Mono" :weight light))))
     `(variable-pitch ((t (:family "SF Pro Text" :weight light))))
     `(default ((t (:background ,white :foreground ,dark :weight light))))
     `(cursor ((t (:background ,blue))))
     `(fringe ((t (:background ,white))))
     `(region ((t (:background ,highlight-dim))))
     `(highlight ((t (:background nil))))

     `(font-lock-builtin-face ((t (:weight bold))))
     `(font-lock-constant-face ((t (:weight bold))))
     `(font-lock-function-name-face ((t (:weight bold))))
     `(font-lock-keyword-face ((t (:weight bold))))
     `(font-lock-variable-name-face ((t (:weight bold))))
     `(font-lock-type-face ((t (:weight bold))))
     `(font-lock-string-face ((t (:weight thin))))

     `(font-lock-warning-face ((t (:foreground ,red))))
     `(font-lock-comment-face ((t (:weight thin))))
     `(font-lock-comment-delimiter-face ((t (:weight thin))))

     `(org-drawer ((t (:foreground ,lgrey))))
     `(org-special-keyword ((t (:inherit org-drawer
                                         :foreground ,dark))))
     `(org-block ((t (:background ,code-background :extend t))))
     `(org-block-begin-line ((t :inherit org-block)))
     `(link ((t :foreground ,dark
                :underline t)))
     `(org-document-title ((t (:foreground ,dark
                               :height 220))))


     `(mode-line ((t (:box (:line-width 5
                                        :color ,xgrey)
                           ;;:underline nil
                           ;;:overline ,xbord
                           :foreground ,dark
                           :background ,xgrey
                           :inherit variable-pitch
                           :height 110))))
     `(mode-line-inactive ((t (:inherit mode-line
                               :foreground ,lgrey))))


     ))

  (provide-theme 'actuator)

  ;; Local Variables:
  ;; no-byte-compile: t
  ;; End:

  ;;; actuator-theme.el ends here
#+end_src
* Stable
:PROPERTIES:
:header-args: :tangle ~/.config/emacs/init.el :comments link :noweb yes
:END:
** Read only
#+begin_src emacs-lisp
  (setq view-read-only t)
#+end_src

** Reset garbage collection
#+begin_src emacs-lisp
  <<init-garbage-collection>>
#+end_src

** Ctrl-Z
#+begin_src emacs-lisp
  (global-unset-key (kbd "C-z"))
#+end_src

** Just one space
#+begin_src emacs-lisp
  (defun actuator-just-one-space ()
    "Insert just one space, killing ALL whitespace."
    (interactive)
    (just-one-space -1))

  (global-set-key (kbd "<M-SPC>") 'actuator-just-one-space)
#+end_src
** Unfill paragraph
#+begin_src emacs-lisp
  (defun actuator-unfill-paragraph ()
    "Unfills a paragraph."
    (interactive)
    (let ((fill-column most-positive-fixnum))
      (fill-paragraph)))
  (global-set-key (kbd "C-M-q") 'actuator-unfill-paragraph)
#+end_src
** Savehist
#+begin_src emacs-lisp
  (use-package savehist
    :ensure nil
    :config
    (savehist-mode)
    :custom
    (history-length 1000)
    (history-delete-duplicates t)
    (message-log-max 1000)
    (savehist-save-minibuffer-history t)
    (savehist-additional-variables
     '(buffer-name-history
       command-history
       compile-history
       extended-command-history
       file-name-history
       file-name-history
       global-mark-ring
       Info-history-list
       kill-ring
       kmacro-ring
       last-kbd-macro
       minibuffer-history
       org-link--history
       org-read-date-history
       org-refile-history
       org-table-formula-history
       org-tags-history
       regexp-search-ring
       register-alist
       savehist-minibuffer-history-variables
       shell-command-history
       mark-ring)))
#+end_src

1. Quick fixes:

   ;; the issue could be that save-interprogram-paste-before-kill means a large clipboard which becomes part of savehist:

https://github.com/syl20bnr/spacemacs/issues/9409

#+begin_src emacs-lisp
  (put 'minibuffer-history 'history-length 100)
  (put 'kill-ring 'history-length 25)
  (setq save-interprogram-paste-before-kill nil)
#+end_src

https://emacs.stackexchange.com/questions/4187/strip-text-properties-in-savehist

2. Unpropertize kill ring on quit
#+begin_src emacs-lisp
  (defun actuator-unpropertize-kill-ring ()
    "It do thing."
    (setq kill-ring (mapcar 'substring-no-properties kill-ring)))

  (add-hook 'kill-emacs-hook #'actuator-unpropertize-kill-ring)
  (add-hook 'after-save-hook #'actuator-unpropertize-kill-ring)
#+end_src

3. Savehist on kill only

#+begin_src emacs-lisp
  (setq savehist-autosave-interval nil)
  (add-hook 'kill-emacs-hook #'savehist-save)
  (add-hook 'after-save-hook #'savehist-save)
#+end_src
** Autorevert
#+begin_src emacs-lisp
  (use-package autorevert
    :ensure nil
    :config
    (global-auto-revert-mode 1)
    :custom
    (global-auto-revert-non-file-buffers nil)
    (auto-revert-verbose nil)
    (auto-revert-avoid-polling t)
    (buffer-auto-revert-by-notification t)
    (auto-revert-interval 60)
    (revert-without-query t)
    (auto-revert-check-vc-info nil))
#+end_src
** Server

#+begin_src emacs-lisp
  (use-package server
    :ensure nil
    :init
    (load "server")
    (unless (server-running-p) (server-start)))
#+end_src

** Undo
- [[https://b3n.sdf-eu.org/undo-in-emacs.html][Undo in Emacs]]

  #+begin_src emacs-lisp
    (global-set-key (kbd "s-z") #'undo-only)
    (global-set-key (kbd "s-Z") #'undo-redo)
  #+end_src
** Cancel GC in Minibuffer
#+begin_src emacs-lisp
  (defun actuator-minibuffer-setup-hook ()
    (setq gc-cons-threshold (* 500 1024 1024)))

  (defun actuator-minibuffer-exit-hook ()
    (setq gc-cons-threshold 800000))

  (add-hook 'minibuffer-setup-hook #'actuator-minibuffer-setup-hook)
  (add-hook 'minibuffer-exit-hook  #'actuator-minibuffer-exit-hook)
#+end_src
** Minibuffer Resize
#+begin_src emacs-lisp
  (add-hook 'minibuffer-setup-hook 'actuator-minibuffer-setup)

  (defun actuator-minibuffer-setup ()
         (set (make-local-variable 'face-remapping-alist)
            '((org-document-title :height 1.0))))
#+end_src
** Hippie Expand

#+begin_src emacs-lisp
  (use-package hippie-exp
    :ensure nil
    :bind ("M-/" . hippie-expand)
    :custom
    (hippie-expand-verbose t)
    (hippie-expand-try-functions-list
     '(try-expand-all-abbrevs
       try-expand-dabbrev-visible
       try-expand-dabbrev
       try-expand-dabbrev-all-buffers
       try-expand-dabbrev-from-kill
       try-complete-file-name-partially
       try-complete-file-name
       try-expand-line
       try-complete-lisp-symbol-partially
       try-complete-lisp-symbol
       try-expand-list
       try-expand-list-all-buffers
       try-expand-whole-kill
       try-expand-line-all-buffers)))
#+end_src

- try-complete-lisp-symbol has a lot of completions
- try-expand-line-all-buffers is very slow

#+begin_src emacs-lisp
  (defun actuator-hippie-unexpand ()
    "Remove an expansion without having to loop around."
    (interactive)
    (hippie-expand 0))
  (global-set-key (kbd "<backtab>") #'actuator-hippie-unexpand)
#+end_src

** Open org-links in new window or not
#+begin_src emacs-lisp
  (use-package ol
    :ensure nil
    :custom
    (org-link-frame-setup '((vm . vm-visit-folder-other-frame)
                            (vm-imap . vm-visit-imap-folder-other-frame)
                            (gnus . org-gnus-no-new-news)
                            (file . find-file))))
#+end_src
* Unstable
:PROPERTIES:
:header-args: :tangle ~/.config/emacs/init.el :noweb yes
:END:
** Auto-upgrade
#+begin_src emacs-lisp
    (use-package auto-package-update
      :ensure t
      :demand t
      :config
      (require 'auto-package-update)
      :hook (auto-package-update-before . actuator-backup-emacs-directory))
#+end_src

#+begin_src emacs-lisp
  (defun actuator-backup-emacs-directory ()
    "It does."
    (shell-command "BORG_REPO=~/Backup/emacs borg create --stats --verbose \\
  --compression zstd,22 ::{hostname}-{now} \\
  ~/.config/emacs" "*Package backup log*")
    (shell-command "BORG_REPO=~/Backup/emacs borg prune --stats --keep-last 10 \\
  --save-space" "*Package backup log*"))
#+end_src

** SVG Screenshot
#+begin_src emacs-lisp
  (defun screenshot-svg ()
    “Save a screenshot of the current frame as an SVG image.
  Saves to a temp file and puts the filename in the kill ring.”
    (interactive)
    (let* ((filename (make-temp-file “Emacs” nil “.svg”))
           (data (x-export-frames nil ‘svg)))
      (with-temp-file filename
        (insert data))
      (kill-new filename)
      (message filename)))
#+end_src
** Git autocommit
#+begin_src emacs-lisp
  (use-package git-auto-commit-mode
    :ensure t)
#+end_src

** Sunrise/set

#+begin_src emacs-lisp
  (require 'solar)
  (setq calendar-location-name "St. John's, NL")

  (defun solar-sunrise-string (date &optional nolocation)
    "String of *local* time of sunrise and daylight on Gregorian DATE."
    (let ((l (solar-sunrise-sunset date)))
      (format
       "%s (%s hours daylight)"
       (if (car l)
       (concat "Sunrise " (apply 'solar-time-string (car l)))
         "no sunrise")
       (nth 2 l)
       )))
  ;; To be called from diary-list-sexp-entries, where DATE is bound.
  ;;;###diary-autoload
  (defun diary-sunrise ()
    "Local time of sunrise as a diary entry.
    Accurate to a few seconds."
    (or (and calendar-latitude calendar-longitude calendar-time-zone)
        (solar-setup))
    (solar-sunrise-string date))

    (defun solar-sunset-string (date &optional nolocation)
    "String of *local* time of sunset and daylight on Gregorian DATE."
    (let ((l (solar-sunrise-sunset date)))
      (format
       "%s (%s hours daylight)"
       (if (cadr l)
       (concat "Sunset " (apply 'solar-time-string (cadr l)))
         "no sunset")
       (nth 2 l)
       )))
  ;; To be called from diary-list-sexp-entries, where DATE is bound.
  ;;;###diary-autoload
  (defun diary-sunset ()
    "Local time of sunset as a diary entry.
    Accurate to a few seconds."
    (or (and calendar-latitude calendar-longitude calendar-time-zone)
        (solar-setup))
    (solar-sunset-string date))
#+end_src

[[https://www.reddit.com/r/orgmode/comments/a1z26t/sunrise_sunset_as_separate_entries_on_agenda_view/][Sunrise Sunset as Separate Entries on Agenda View (SUPPORT) : orgmode]]
[[https://stackoverflow.com/questions/22889036/custom-diary-sunrise-function-not-working-autoload-diary-emacs][elisp - Custom diary-sunrise function not working. `autoload-diary`? (Emacs.)...]]



